Producto/performance/results/load-baseline.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: performance/k6/load.ts
        output: -

     scenarios: (100.00%) 1 scenario, 30 max VUs, 4m15s max duration (incl. graceful stop):
              * carga_normal: Up to 30 looping VUs for 4m0s over 4 stages (gracefulRampDown: 15s, gracefulStop: 30s)


running (0m01.0s), 00/30 VUs, 0 complete and 0 interrupted iterations
carga_normal   [   0% ] 00/30 VUs  0m01.0s/4m00.0s

running (0m02.0s), 00/30 VUs, 0 complete and 0 interrupted iterations
carga_normal   [   1% ] 00/30 VUs  0m02.0s/4m00.0s

running (0m03.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
carga_normal   [   1% ] 01/30 VUs  0m03.0s/4m00.0s

running (0m04.0s), 01/30 VUs, 0 complete and 0 interrupted iterations
carga_normal   [   2% ] 01/30 VUs  0m04.0s/4m00.0s

running (0m05.0s), 02/30 VUs, 1 complete and 0 interrupted iterations
carga_normal   [   2% ] 02/30 VUs  0m05.0s/4m00.0s

running (0m06.0s), 02/30 VUs, 3 complete and 0 interrupted iterations
carga_normal   [   2% ] 02/30 VUs  0m06.0s/4m00.0s

running (0m07.0s), 03/30 VUs, 3 complete and 0 interrupted iterations
carga_normal   [   3% ] 03/30 VUs  0m07.0s/4m00.0s

running (0m08.0s), 03/30 VUs, 4 complete and 0 interrupted iterations
carga_normal   [   3% ] 03/30 VUs  0m08.0s/4m00.0s

running (0m09.0s), 04/30 VUs, 6 complete and 0 interrupted iterations
carga_normal   [   4% ] 04/30 VUs  0m09.0s/4m00.0s

running (0m10.0s), 04/30 VUs, 7 complete and 0 interrupted iterations
carga_normal   [   4% ] 04/30 VUs  0m10.0s/4m00.0s

running (0m11.0s), 05/30 VUs, 9 complete and 0 interrupted iterations
carga_normal   [   5% ] 05/30 VUs  0m11.0s/4m00.0s

running (0m12.0s), 05/30 VUs, 12 complete and 0 interrupted iterations
carga_normal   [   5% ] 05/30 VUs  0m12.0s/4m00.0s

running (0m13.0s), 06/30 VUs, 14 complete and 0 interrupted iterations
carga_normal   [   5% ] 06/30 VUs  0m13.0s/4m00.0s

running (0m14.0s), 06/30 VUs, 17 complete and 0 interrupted iterations
carga_normal   [   6% ] 06/30 VUs  0m14.0s/4m00.0s

running (0m15.0s), 07/30 VUs, 20 complete and 0 interrupted iterations
carga_normal   [   6% ] 07/30 VUs  0m15.0s/4m00.0s

running (0m16.0s), 07/30 VUs, 23 complete and 0 interrupted iterations
carga_normal   [   7% ] 07/30 VUs  0m16.0s/4m00.0s

running (0m17.0s), 08/30 VUs, 25 complete and 0 interrupted iterations
carga_normal   [   7% ] 08/30 VUs  0m17.0s/4m00.0s

running (0m18.0s), 08/30 VUs, 29 complete and 0 interrupted iterations
carga_normal   [   7% ] 08/30 VUs  0m18.0s/4m00.0s

running (0m19.0s), 09/30 VUs, 32 complete and 0 interrupted iterations
carga_normal   [   8% ] 09/30 VUs  0m19.0s/4m00.0s

running (0m20.0s), 09/30 VUs, 37 complete and 0 interrupted iterations
carga_normal   [   8% ] 09/30 VUs  0m20.0s/4m00.0s

running (0m21.0s), 10/30 VUs, 41 complete and 0 interrupted iterations
carga_normal   [   9% ] 10/30 VUs  0m21.0s/4m00.0s

running (0m22.0s), 10/30 VUs, 47 complete and 0 interrupted iterations
carga_normal   [   9% ] 10/30 VUs  0m22.0s/4m00.0s

running (0m23.0s), 11/30 VUs, 52 complete and 0 interrupted iterations
carga_normal   [  10% ] 11/30 VUs  0m23.0s/4m00.0s

running (0m24.0s), 11/30 VUs, 57 complete and 0 interrupted iterations
carga_normal   [  10% ] 11/30 VUs  0m24.0s/4m00.0s

running (0m25.0s), 12/30 VUs, 63 complete and 0 interrupted iterations
carga_normal   [  10% ] 12/30 VUs  0m25.0s/4m00.0s

running (0m26.0s), 12/30 VUs, 67 complete and 0 interrupted iterations
carga_normal   [  11% ] 12/30 VUs  0m26.0s/4m00.0s

running (0m27.0s), 13/30 VUs, 75 complete and 0 interrupted iterations
carga_normal   [  11% ] 13/30 VUs  0m27.0s/4m00.0s

running (0m28.0s), 13/30 VUs, 81 complete and 0 interrupted iterations
carga_normal   [  12% ] 13/30 VUs  0m28.0s/4m00.0s

running (0m29.0s), 14/30 VUs, 88 complete and 0 interrupted iterations
carga_normal   [  12% ] 14/30 VUs  0m29.0s/4m00.0s

running (0m30.0s), 14/30 VUs, 96 complete and 0 interrupted iterations
carga_normal   [  12% ] 14/30 VUs  0m30.0s/4m00.0s

running (0m31.0s), 15/30 VUs, 101 complete and 0 interrupted iterations
carga_normal   [  13% ] 15/30 VUs  0m31.0s/4m00.0s

running (0m32.0s), 15/30 VUs, 111 complete and 0 interrupted iterations
carga_normal   [  13% ] 15/30 VUs  0m32.0s/4m00.0s

running (0m33.0s), 15/30 VUs, 115 complete and 0 interrupted iterations
carga_normal   [  14% ] 15/30 VUs  0m33.0s/4m00.0s

running (0m34.0s), 15/30 VUs, 126 complete and 0 interrupted iterations
carga_normal   [  14% ] 15/30 VUs  0m34.0s/4m00.0s

running (0m35.0s), 16/30 VUs, 136 complete and 0 interrupted iterations
carga_normal   [  15% ] 16/30 VUs  0m35.0s/4m00.0s

running (0m36.0s), 16/30 VUs, 140 complete and 0 interrupted iterations
carga_normal   [  15% ] 16/30 VUs  0m36.0s/4m00.0s

running (0m37.0s), 16/30 VUs, 151 complete and 0 interrupted iterations
carga_normal   [  15% ] 16/30 VUs  0m37.0s/4m00.0s

running (0m38.0s), 16/30 VUs, 157 complete and 0 interrupted iterations
carga_normal   [  16% ] 16/30 VUs  0m38.0s/4m00.0s

running (0m39.0s), 17/30 VUs, 165 complete and 0 interrupted iterations
carga_normal   [  16% ] 17/30 VUs  0m39.0s/4m00.0s

running (0m40.0s), 17/30 VUs, 173 complete and 0 interrupted iterations
carga_normal   [  17% ] 17/30 VUs  0m40.0s/4m00.0s

running (0m41.0s), 17/30 VUs, 180 complete and 0 interrupted iterations
carga_normal   [  17% ] 17/30 VUs  0m41.0s/4m00.0s

running (0m42.0s), 17/30 VUs, 192 complete and 0 interrupted iterations
carga_normal   [  17% ] 17/30 VUs  0m42.0s/4m00.0s

running (0m43.0s), 18/30 VUs, 196 complete and 0 interrupted iterations
carga_normal   [  18% ] 18/30 VUs  0m43.0s/4m00.0s

running (0m44.0s), 18/30 VUs, 207 complete and 0 interrupted iterations
carga_normal   [  18% ] 18/30 VUs  0m44.0s/4m00.0s

running (0m45.0s), 18/30 VUs, 216 complete and 0 interrupted iterations
carga_normal   [  19% ] 18/30 VUs  0m45.0s/4m00.0s

running (0m46.0s), 18/30 VUs, 223 complete and 0 interrupted iterations
carga_normal   [  19% ] 18/30 VUs  0m46.0s/4m00.0s

running (0m47.0s), 19/30 VUs, 235 complete and 0 interrupted iterations
carga_normal   [  20% ] 19/30 VUs  0m47.0s/4m00.0s

running (0m48.0s), 19/30 VUs, 240 complete and 0 interrupted iterations
carga_normal   [  20% ] 19/30 VUs  0m48.0s/4m00.0s

running (0m49.0s), 19/30 VUs, 251 complete and 0 interrupted iterations
carga_normal   [  20% ] 19/30 VUs  0m49.0s/4m00.0s

running (0m50.0s), 19/30 VUs, 261 complete and 0 interrupted iterations
carga_normal   [  21% ] 19/30 VUs  0m50.0s/4m00.0s

running (0m51.0s), 20/30 VUs, 271 complete and 0 interrupted iterations
carga_normal   [  21% ] 20/30 VUs  0m51.0s/4m00.0s

running (0m52.0s), 20/30 VUs, 278 complete and 0 interrupted iterations
carga_normal   [  22% ] 20/30 VUs  0m52.0s/4m00.0s

running (0m53.0s), 20/30 VUs, 290 complete and 0 interrupted iterations
carga_normal   [  22% ] 20/30 VUs  0m53.0s/4m00.0s

running (0m54.0s), 20/30 VUs, 297 complete and 0 interrupted iterations
carga_normal   [  22% ] 20/30 VUs  0m54.0s/4m00.0s

running (0m55.0s), 21/30 VUs, 308 complete and 0 interrupted iterations
carga_normal   [  23% ] 21/30 VUs  0m55.0s/4m00.0s

running (0m56.0s), 21/30 VUs, 317 complete and 0 interrupted iterations
carga_normal   [  23% ] 21/30 VUs  0m56.0s/4m00.0s

running (0m57.0s), 21/30 VUs, 326 complete and 0 interrupted iterations
carga_normal   [  24% ] 21/30 VUs  0m57.0s/4m00.0s

running (0m58.0s), 21/30 VUs, 338 complete and 0 interrupted iterations
carga_normal   [  24% ] 21/30 VUs  0m58.0s/4m00.0s

running (0m59.0s), 22/30 VUs, 345 complete and 0 interrupted iterations
carga_normal   [  25% ] 22/30 VUs  0m59.0s/4m00.0s

running (1m00.0s), 22/30 VUs, 356 complete and 0 interrupted iterations
carga_normal   [  25% ] 22/30 VUs  1m00.0s/4m00.0s

running (1m01.0s), 22/30 VUs, 369 complete and 0 interrupted iterations
carga_normal   [  25% ] 22/30 VUs  1m01.0s/4m00.0s

running (1m02.0s), 22/30 VUs, 380 complete and 0 interrupted iterations
carga_normal   [  26% ] 22/30 VUs  1m02.0s/4m00.0s

running (1m03.0s), 23/30 VUs, 389 complete and 0 interrupted iterations
carga_normal   [  26% ] 23/30 VUs  1m03.0s/4m00.0s

running (1m04.0s), 23/30 VUs, 402 complete and 0 interrupted iterations
carga_normal   [  27% ] 23/30 VUs  1m04.0s/4m00.0s

running (1m05.0s), 23/30 VUs, 415 complete and 0 interrupted iterations
carga_normal   [  27% ] 23/30 VUs  1m05.0s/4m00.0s

running (1m06.0s), 23/30 VUs, 422 complete and 0 interrupted iterations
carga_normal   [  27% ] 23/30 VUs  1m06.0s/4m00.0s

running (1m07.0s), 24/30 VUs, 437 complete and 0 interrupted iterations
carga_normal   [  28% ] 24/30 VUs  1m07.0s/4m00.0s

running (1m08.0s), 24/30 VUs, 448 complete and 0 interrupted iterations
carga_normal   [  28% ] 24/30 VUs  1m08.0s/4m00.0s

running (1m09.0s), 24/30 VUs, 462 complete and 0 interrupted iterations
carga_normal   [  29% ] 24/30 VUs  1m09.0s/4m00.0s

running (1m10.0s), 24/30 VUs, 473 complete and 0 interrupted iterations
carga_normal   [  29% ] 24/30 VUs  1m10.0s/4m00.0s

running (1m11.0s), 25/30 VUs, 487 complete and 0 interrupted iterations
carga_normal   [  30% ] 25/30 VUs  1m11.0s/4m00.0s

running (1m12.0s), 25/30 VUs, 494 complete and 0 interrupted iterations
carga_normal   [  30% ] 25/30 VUs  1m12.0s/4m00.0s

running (1m13.0s), 25/30 VUs, 507 complete and 0 interrupted iterations
carga_normal   [  30% ] 25/30 VUs  1m13.0s/4m00.0s

running (1m14.0s), 25/30 VUs, 520 complete and 0 interrupted iterations
carga_normal   [  31% ] 25/30 VUs  1m14.0s/4m00.0s

running (1m15.0s), 26/30 VUs, 530 complete and 0 interrupted iterations
carga_normal   [  31% ] 26/30 VUs  1m15.0s/4m00.0s

running (1m16.0s), 26/30 VUs, 548 complete and 0 interrupted iterations
carga_normal   [  32% ] 26/30 VUs  1m16.0s/4m00.0s

running (1m17.0s), 26/30 VUs, 560 complete and 0 interrupted iterations
carga_normal   [  32% ] 26/30 VUs  1m17.0s/4m00.0s

running (1m18.0s), 26/30 VUs, 568 complete and 0 interrupted iterations
carga_normal   [  32% ] 26/30 VUs  1m18.0s/4m00.0s

running (1m19.0s), 27/30 VUs, 583 complete and 0 interrupted iterations
carga_normal   [  33% ] 27/30 VUs  1m19.0s/4m00.0s

running (1m20.0s), 27/30 VUs, 596 complete and 0 interrupted iterations
carga_normal   [  33% ] 27/30 VUs  1m20.0s/4m00.0s

running (1m21.0s), 27/30 VUs, 607 complete and 0 interrupted iterations
carga_normal   [  34% ] 27/30 VUs  1m21.0s/4m00.0s

running (1m22.0s), 27/30 VUs, 624 complete and 0 interrupted iterations
carga_normal   [  34% ] 27/30 VUs  1m22.0s/4m00.0s

running (1m23.0s), 28/30 VUs, 633 complete and 0 interrupted iterations
carga_normal   [  35% ] 28/30 VUs  1m23.0s/4m00.0s

running (1m24.0s), 28/30 VUs, 649 complete and 0 interrupted iterations
carga_normal   [  35% ] 28/30 VUs  1m24.0s/4m00.0s

running (1m25.0s), 28/30 VUs, 659 complete and 0 interrupted iterations
carga_normal   [  35% ] 28/30 VUs  1m25.0s/4m00.0s

running (1m26.0s), 28/30 VUs, 678 complete and 0 interrupted iterations
carga_normal   [  36% ] 28/30 VUs  1m26.0s/4m00.0s

running (1m27.0s), 29/30 VUs, 686 complete and 0 interrupted iterations
carga_normal   [  36% ] 29/30 VUs  1m27.0s/4m00.0s

running (1m28.0s), 29/30 VUs, 703 complete and 0 interrupted iterations
carga_normal   [  37% ] 29/30 VUs  1m28.0s/4m00.0s

running (1m29.0s), 29/30 VUs, 715 complete and 0 interrupted iterations
carga_normal   [  37% ] 29/30 VUs  1m29.0s/4m00.0s

running (1m30.0s), 29/30 VUs, 729 complete and 0 interrupted iterations
carga_normal   [  37% ] 29/30 VUs  1m30.0s/4m00.0s

running (1m31.0s), 30/30 VUs, 744 complete and 0 interrupted iterations
carga_normal   [  38% ] 30/30 VUs  1m31.0s/4m00.0s

running (1m32.0s), 30/30 VUs, 759 complete and 0 interrupted iterations
carga_normal   [  38% ] 30/30 VUs  1m32.0s/4m00.0s

running (1m33.0s), 30/30 VUs, 778 complete and 0 interrupted iterations
carga_normal   [  39% ] 30/30 VUs  1m33.0s/4m00.0s

running (1m34.0s), 30/30 VUs, 791 complete and 0 interrupted iterations
carga_normal   [  39% ] 30/30 VUs  1m34.0s/4m00.0s

running (1m35.0s), 30/30 VUs, 804 complete and 0 interrupted iterations
carga_normal   [  40% ] 30/30 VUs  1m35.0s/4m00.0s

running (1m36.0s), 30/30 VUs, 817 complete and 0 interrupted iterations
carga_normal   [  40% ] 30/30 VUs  1m36.0s/4m00.0s

running (1m37.0s), 30/30 VUs, 833 complete and 0 interrupted iterations
carga_normal   [  40% ] 30/30 VUs  1m37.0s/4m00.0s

running (1m38.0s), 30/30 VUs, 848 complete and 0 interrupted iterations
carga_normal   [  41% ] 30/30 VUs  1m38.0s/4m00.0s

running (1m39.0s), 30/30 VUs, 857 complete and 0 interrupted iterations
carga_normal   [  41% ] 30/30 VUs  1m39.0s/4m00.0s

running (1m40.0s), 30/30 VUs, 877 complete and 0 interrupted iterations
carga_normal   [  42% ] 30/30 VUs  1m40.0s/4m00.0s

running (1m41.0s), 30/30 VUs, 893 complete and 0 interrupted iterations
carga_normal   [  42% ] 30/30 VUs  1m41.0s/4m00.0s

running (1m42.0s), 30/30 VUs, 906 complete and 0 interrupted iterations
carga_normal   [  42% ] 30/30 VUs  1m42.0s/4m00.0s

running (1m43.0s), 30/30 VUs, 923 complete and 0 interrupted iterations
carga_normal   [  43% ] 30/30 VUs  1m43.0s/4m00.0s

running (1m44.0s), 30/30 VUs, 932 complete and 0 interrupted iterations
carga_normal   [  43% ] 30/30 VUs  1m44.0s/4m00.0s

running (1m45.0s), 30/30 VUs, 950 complete and 0 interrupted iterations
carga_normal   [  44% ] 30/30 VUs  1m45.0s/4m00.0s

running (1m46.0s), 30/30 VUs, 963 complete and 0 interrupted iterations
carga_normal   [  44% ] 30/30 VUs  1m46.0s/4m00.0s

running (1m47.0s), 30/30 VUs, 983 complete and 0 interrupted iterations
carga_normal   [  45% ] 30/30 VUs  1m47.0s/4m00.0s

running (1m48.0s), 30/30 VUs, 992 complete and 0 interrupted iterations
carga_normal   [  45% ] 30/30 VUs  1m48.0s/4m00.0s

running (1m49.0s), 30/30 VUs, 1007 complete and 0 interrupted iterations
carga_normal   [  45% ] 30/30 VUs  1m49.0s/4m00.0s

running (1m50.0s), 30/30 VUs, 1025 complete and 0 interrupted iterations
carga_normal   [  46% ] 30/30 VUs  1m50.0s/4m00.0s

running (1m51.0s), 30/30 VUs, 1035 complete and 0 interrupted iterations
carga_normal   [  46% ] 30/30 VUs  1m51.0s/4m00.0s

running (1m52.0s), 30/30 VUs, 1053 complete and 0 interrupted iterations
carga_normal   [  47% ] 30/30 VUs  1m52.0s/4m00.0s

running (1m53.0s), 30/30 VUs, 1065 complete and 0 interrupted iterations
carga_normal   [  47% ] 30/30 VUs  1m53.0s/4m00.0s

running (1m54.0s), 30/30 VUs, 1077 complete and 0 interrupted iterations
carga_normal   [  47% ] 30/30 VUs  1m54.0s/4m00.0s

running (1m55.0s), 30/30 VUs, 1094 complete and 0 interrupted iterations
carga_normal   [  48% ] 30/30 VUs  1m55.0s/4m00.0s

running (1m56.0s), 30/30 VUs, 1108 complete and 0 interrupted iterations
carga_normal   [  48% ] 30/30 VUs  1m56.0s/4m00.0s

running (1m57.0s), 30/30 VUs, 1122 complete and 0 interrupted iterations
carga_normal   [  49% ] 30/30 VUs  1m57.0s/4m00.0s

running (1m58.0s), 30/30 VUs, 1135 complete and 0 interrupted iterations
carga_normal   [  49% ] 30/30 VUs  1m58.0s/4m00.0s

running (1m59.0s), 30/30 VUs, 1153 complete and 0 interrupted iterations
carga_normal   [  50% ] 30/30 VUs  1m59.0s/4m00.0s

running (2m00.0s), 30/30 VUs, 1167 complete and 0 interrupted iterations
carga_normal   [  50% ] 30/30 VUs  2m00.0s/4m00.0s

running (2m01.0s), 30/30 VUs, 1179 complete and 0 interrupted iterations
carga_normal   [  50% ] 30/30 VUs  2m01.0s/4m00.0s

running (2m02.0s), 30/30 VUs, 1194 complete and 0 interrupted iterations
carga_normal   [  51% ] 30/30 VUs  2m02.0s/4m00.0s

running (2m03.0s), 30/30 VUs, 1207 complete and 0 interrupted iterations
carga_normal   [  51% ] 30/30 VUs  2m03.0s/4m00.0s

running (2m04.0s), 30/30 VUs, 1223 complete and 0 interrupted iterations
carga_normal   [  52% ] 30/30 VUs  2m04.0s/4m00.0s

running (2m05.0s), 30/30 VUs, 1240 complete and 0 interrupted iterations
carga_normal   [  52% ] 30/30 VUs  2m05.0s/4m00.0s

running (2m06.0s), 30/30 VUs, 1254 complete and 0 interrupted iterations
carga_normal   [  52% ] 30/30 VUs  2m06.0s/4m00.0s

running (2m07.0s), 30/30 VUs, 1269 complete and 0 interrupted iterations
carga_normal   [  53% ] 30/30 VUs  2m07.0s/4m00.0s

running (2m08.0s), 30/30 VUs, 1284 complete and 0 interrupted iterations
carga_normal   [  53% ] 30/30 VUs  2m08.0s/4m00.0s

running (2m09.0s), 30/30 VUs, 1296 complete and 0 interrupted iterations
carga_normal   [  54% ] 30/30 VUs  2m09.0s/4m00.0s

running (2m10.0s), 30/30 VUs, 1313 complete and 0 interrupted iterations
carga_normal   [  54% ] 30/30 VUs  2m10.0s/4m00.0s

running (2m11.0s), 30/30 VUs, 1322 complete and 0 interrupted iterations
carga_normal   [  55% ] 30/30 VUs  2m11.0s/4m00.0s

running (2m12.0s), 30/30 VUs, 1340 complete and 0 interrupted iterations
carga_normal   [  55% ] 30/30 VUs  2m12.0s/4m00.0s

running (2m13.0s), 30/30 VUs, 1352 complete and 0 interrupted iterations
carga_normal   [  55% ] 30/30 VUs  2m13.0s/4m00.0s

running (2m14.0s), 30/30 VUs, 1367 complete and 0 interrupted iterations
carga_normal   [  56% ] 30/30 VUs  2m14.0s/4m00.0s

running (2m15.0s), 30/30 VUs, 1382 complete and 0 interrupted iterations
carga_normal   [  56% ] 30/30 VUs  2m15.0s/4m00.0s

running (2m16.0s), 30/30 VUs, 1392 complete and 0 interrupted iterations
carga_normal   [  57% ] 30/30 VUs  2m16.0s/4m00.0s

running (2m17.0s), 30/30 VUs, 1410 complete and 0 interrupted iterations
carga_normal   [  57% ] 30/30 VUs  2m17.0s/4m00.0s

running (2m18.0s), 30/30 VUs, 1427 complete and 0 interrupted iterations
carga_normal   [  57% ] 30/30 VUs  2m18.0s/4m00.0s

running (2m19.0s), 30/30 VUs, 1439 complete and 0 interrupted iterations
carga_normal   [  58% ] 30/30 VUs  2m19.0s/4m00.0s

running (2m20.0s), 30/30 VUs, 1452 complete and 0 interrupted iterations
carga_normal   [  58% ] 30/30 VUs  2m20.0s/4m00.0s

running (2m21.0s), 30/30 VUs, 1467 complete and 0 interrupted iterations
carga_normal   [  59% ] 30/30 VUs  2m21.0s/4m00.0s

running (2m22.0s), 30/30 VUs, 1485 complete and 0 interrupted iterations
carga_normal   [  59% ] 30/30 VUs  2m22.0s/4m00.0s

running (2m23.0s), 30/30 VUs, 1497 complete and 0 interrupted iterations
carga_normal   [  60% ] 30/30 VUs  2m23.0s/4m00.0s

running (2m24.0s), 30/30 VUs, 1512 complete and 0 interrupted iterations
carga_normal   [  60% ] 30/30 VUs  2m24.0s/4m00.0s

running (2m25.0s), 30/30 VUs, 1530 complete and 0 interrupted iterations
carga_normal   [  60% ] 30/30 VUs  2m25.0s/4m00.0s

running (2m26.0s), 30/30 VUs, 1544 complete and 0 interrupted iterations
carga_normal   [  61% ] 30/30 VUs  2m26.0s/4m00.0s

running (2m27.0s), 30/30 VUs, 1555 complete and 0 interrupted iterations
carga_normal   [  61% ] 30/30 VUs  2m27.0s/4m00.0s

running (2m28.0s), 30/30 VUs, 1570 complete and 0 interrupted iterations
carga_normal   [  62% ] 30/30 VUs  2m28.0s/4m00.0s

running (2m29.0s), 30/30 VUs, 1589 complete and 0 interrupted iterations
carga_normal   [  62% ] 30/30 VUs  2m29.0s/4m00.0s

running (2m30.0s), 30/30 VUs, 1604 complete and 0 interrupted iterations
carga_normal   [  62% ] 30/30 VUs  2m30.0s/4m00.0s

running (2m31.0s), 30/30 VUs, 1619 complete and 0 interrupted iterations
carga_normal   [  63% ] 30/30 VUs  2m31.0s/4m00.0s

running (2m32.0s), 30/30 VUs, 1630 complete and 0 interrupted iterations
carga_normal   [  63% ] 30/30 VUs  2m32.0s/4m00.0s

running (2m33.0s), 30/30 VUs, 1644 complete and 0 interrupted iterations
carga_normal   [  64% ] 30/30 VUs  2m33.0s/4m00.0s

running (2m34.0s), 30/30 VUs, 1661 complete and 0 interrupted iterations
carga_normal   [  64% ] 30/30 VUs  2m34.0s/4m00.0s

running (2m35.0s), 30/30 VUs, 1679 complete and 0 interrupted iterations
carga_normal   [  65% ] 30/30 VUs  2m35.0s/4m00.0s

running (2m36.0s), 30/30 VUs, 1686 complete and 0 interrupted iterations
carga_normal   [  65% ] 30/30 VUs  2m36.0s/4m00.0s

running (2m37.0s), 30/30 VUs, 1703 complete and 0 interrupted iterations
carga_normal   [  65% ] 30/30 VUs  2m37.0s/4m00.0s

running (2m38.0s), 30/30 VUs, 1719 complete and 0 interrupted iterations
carga_normal   [  66% ] 30/30 VUs  2m38.0s/4m00.0s

running (2m39.0s), 30/30 VUs, 1734 complete and 0 interrupted iterations
carga_normal   [  66% ] 30/30 VUs  2m39.0s/4m00.0s

running (2m40.0s), 30/30 VUs, 1747 complete and 0 interrupted iterations
carga_normal   [  67% ] 30/30 VUs  2m40.0s/4m00.0s

running (2m41.0s), 30/30 VUs, 1761 complete and 0 interrupted iterations
carga_normal   [  67% ] 30/30 VUs  2m41.0s/4m00.0s

running (2m42.0s), 30/30 VUs, 1775 complete and 0 interrupted iterations
carga_normal   [  67% ] 30/30 VUs  2m42.0s/4m00.0s

running (2m43.0s), 30/30 VUs, 1793 complete and 0 interrupted iterations
carga_normal   [  68% ] 30/30 VUs  2m43.0s/4m00.0s

running (2m44.0s), 30/30 VUs, 1805 complete and 0 interrupted iterations
carga_normal   [  68% ] 30/30 VUs  2m44.0s/4m00.0s

running (2m45.0s), 30/30 VUs, 1823 complete and 0 interrupted iterations
carga_normal   [  69% ] 30/30 VUs  2m45.0s/4m00.0s

running (2m46.0s), 30/30 VUs, 1834 complete and 0 interrupted iterations
carga_normal   [  69% ] 30/30 VUs  2m46.0s/4m00.0s

running (2m47.0s), 30/30 VUs, 1853 complete and 0 interrupted iterations
carga_normal   [  70% ] 30/30 VUs  2m47.0s/4m00.0s

running (2m48.0s), 30/30 VUs, 1866 complete and 0 interrupted iterations
carga_normal   [  70% ] 30/30 VUs  2m48.0s/4m00.0s

running (2m49.0s), 30/30 VUs, 1884 complete and 0 interrupted iterations
carga_normal   [  70% ] 30/30 VUs  2m49.0s/4m00.0s

running (2m50.0s), 30/30 VUs, 1897 complete and 0 interrupted iterations
carga_normal   [  71% ] 30/30 VUs  2m50.0s/4m00.0s

running (2m51.0s), 30/30 VUs, 1911 complete and 0 interrupted iterations
carga_normal   [  71% ] 30/30 VUs  2m51.0s/4m00.0s

running (2m52.0s), 30/30 VUs, 1923 complete and 0 interrupted iterations
carga_normal   [  72% ] 30/30 VUs  2m52.0s/4m00.0s

running (2m53.0s), 30/30 VUs, 1939 complete and 0 interrupted iterations
carga_normal   [  72% ] 30/30 VUs  2m53.0s/4m00.0s

running (2m54.0s), 30/30 VUs, 1953 complete and 0 interrupted iterations
carga_normal   [  72% ] 30/30 VUs  2m54.0s/4m00.0s

running (2m55.0s), 30/30 VUs, 1965 complete and 0 interrupted iterations
carga_normal   [  73% ] 30/30 VUs  2m55.0s/4m00.0s

running (2m56.0s), 30/30 VUs, 1981 complete and 0 interrupted iterations
carga_normal   [  73% ] 30/30 VUs  2m56.0s/4m00.0s

running (2m57.0s), 30/30 VUs, 1997 complete and 0 interrupted iterations
carga_normal   [  74% ] 30/30 VUs  2m57.0s/4m00.0s

running (2m58.0s), 30/30 VUs, 2014 complete and 0 interrupted iterations
carga_normal   [  74% ] 30/30 VUs  2m58.0s/4m00.0s

running (2m59.0s), 30/30 VUs, 2024 complete and 0 interrupted iterations
carga_normal   [  75% ] 30/30 VUs  2m59.0s/4m00.0s

running (3m00.0s), 30/30 VUs, 2040 complete and 0 interrupted iterations
carga_normal   [  75% ] 30/30 VUs  3m00.0s/4m00.0s

running (3m01.0s), 30/30 VUs, 2056 complete and 0 interrupted iterations
carga_normal   [  75% ] 30/30 VUs  3m01.0s/4m00.0s

running (3m02.0s), 30/30 VUs, 2069 complete and 0 interrupted iterations
carga_normal   [  76% ] 30/30 VUs  3m02.0s/4m00.0s

running (3m03.0s), 30/30 VUs, 2082 complete and 0 interrupted iterations
carga_normal   [  76% ] 30/30 VUs  3m03.0s/4m00.0s

running (3m04.0s), 30/30 VUs, 2100 complete and 0 interrupted iterations
carga_normal   [  77% ] 30/30 VUs  3m04.0s/4m00.0s

running (3m05.0s), 30/30 VUs, 2113 complete and 0 interrupted iterations
carga_normal   [  77% ] 30/30 VUs  3m05.0s/4m00.0s

running (3m06.0s), 30/30 VUs, 2128 complete and 0 interrupted iterations
carga_normal   [  77% ] 30/30 VUs  3m06.0s/4m00.0s

running (3m07.0s), 30/30 VUs, 2142 complete and 0 interrupted iterations
carga_normal   [  78% ] 30/30 VUs  3m07.0s/4m00.0s

running (3m08.0s), 30/30 VUs, 2159 complete and 0 interrupted iterations
carga_normal   [  78% ] 30/30 VUs  3m08.0s/4m00.0s

running (3m09.0s), 30/30 VUs, 2169 complete and 0 interrupted iterations
carga_normal   [  79% ] 30/30 VUs  3m09.0s/4m00.0s

running (3m10.0s), 30/30 VUs, 2186 complete and 0 interrupted iterations
carga_normal   [  79% ] 30/30 VUs  3m10.0s/4m00.0s

running (3m11.0s), 30/30 VUs, 2202 complete and 0 interrupted iterations
carga_normal   [  80% ] 30/30 VUs  3m11.0s/4m00.0s

running (3m12.0s), 30/30 VUs, 2216 complete and 0 interrupted iterations
carga_normal   [  80% ] 30/30 VUs  3m12.0s/4m00.0s

running (3m13.0s), 30/30 VUs, 2224 complete and 0 interrupted iterations
carga_normal   [  80% ] 30/30 VUs  3m13.0s/4m00.0s

running (3m14.0s), 30/30 VUs, 2245 complete and 0 interrupted iterations
carga_normal   [  81% ] 30/30 VUs  3m14.0s/4m00.0s

running (3m15.0s), 30/30 VUs, 2253 complete and 0 interrupted iterations
carga_normal   [  81% ] 30/30 VUs  3m15.0s/4m00.0s

running (3m16.0s), 30/30 VUs, 2271 complete and 0 interrupted iterations
carga_normal   [  82% ] 30/30 VUs  3m16.0s/4m00.0s

running (3m17.0s), 30/30 VUs, 2283 complete and 0 interrupted iterations
carga_normal   [  82% ] 30/30 VUs  3m17.0s/4m00.0s

running (3m18.0s), 30/30 VUs, 2300 complete and 0 interrupted iterations
carga_normal   [  82% ] 30/30 VUs  3m18.0s/4m00.0s

running (3m19.0s), 30/30 VUs, 2313 complete and 0 interrupted iterations
carga_normal   [  83% ] 30/30 VUs  3m19.0s/4m00.0s

running (3m20.0s), 30/30 VUs, 2327 complete and 0 interrupted iterations
carga_normal   [  83% ] 30/30 VUs  3m20.0s/4m00.0s

running (3m21.0s), 30/30 VUs, 2340 complete and 0 interrupted iterations
carga_normal   [  84% ] 30/30 VUs  3m21.0s/4m00.0s

running (3m22.0s), 30/30 VUs, 2359 complete and 0 interrupted iterations
carga_normal   [  84% ] 30/30 VUs  3m22.0s/4m00.0s

running (3m23.0s), 30/30 VUs, 2373 complete and 0 interrupted iterations
carga_normal   [  85% ] 30/30 VUs  3m23.0s/4m00.0s

running (3m24.0s), 30/30 VUs, 2388 complete and 0 interrupted iterations
carga_normal   [  85% ] 30/30 VUs  3m24.0s/4m00.0s

running (3m25.0s), 30/30 VUs, 2399 complete and 0 interrupted iterations
carga_normal   [  85% ] 30/30 VUs  3m25.0s/4m00.0s

running (3m26.0s), 30/30 VUs, 2416 complete and 0 interrupted iterations
carga_normal   [  86% ] 30/30 VUs  3m26.0s/4m00.0s

running (3m27.0s), 30/30 VUs, 2433 complete and 0 interrupted iterations
carga_normal   [  86% ] 30/30 VUs  3m27.0s/4m00.0s

running (3m28.0s), 30/30 VUs, 2447 complete and 0 interrupted iterations
carga_normal   [  87% ] 30/30 VUs  3m28.0s/4m00.0s

running (3m29.0s), 30/30 VUs, 2462 complete and 0 interrupted iterations
carga_normal   [  87% ] 30/30 VUs  3m29.0s/4m00.0s

running (3m30.0s), 30/30 VUs, 2475 complete and 0 interrupted iterations
carga_normal   [  87% ] 30/30 VUs  3m30.0s/4m00.0s

running (3m31.0s), 30/30 VUs, 2488 complete and 0 interrupted iterations
carga_normal   [  88% ] 30/30 VUs  3m31.0s/4m00.0s

running (3m32.0s), 29/30 VUs, 2507 complete and 0 interrupted iterations
carga_normal   [  88% ] 29/30 VUs  3m32.0s/4m00.0s

running (3m33.0s), 29/30 VUs, 2520 complete and 0 interrupted iterations
carga_normal   [  89% ] 29/30 VUs  3m33.0s/4m00.0s

running (3m34.0s), 28/30 VUs, 2534 complete and 0 interrupted iterations
carga_normal   [  89% ] 28/30 VUs  3m34.0s/4m00.0s

running (3m35.0s), 27/30 VUs, 2551 complete and 0 interrupted iterations
carga_normal   [  90% ] 27/30 VUs  3m35.0s/4m00.0s

running (3m36.0s), 26/30 VUs, 2564 complete and 0 interrupted iterations
carga_normal   [  90% ] 26/30 VUs  3m36.0s/4m00.0s

running (3m37.0s), 24/30 VUs, 2576 complete and 0 interrupted iterations
carga_normal   [  90% ] 24/30 VUs  3m37.0s/4m00.0s

running (3m38.0s), 23/30 VUs, 2586 complete and 0 interrupted iterations
carga_normal   [  91% ] 23/30 VUs  3m38.0s/4m00.0s

running (3m39.0s), 22/30 VUs, 2603 complete and 0 interrupted iterations
carga_normal   [  91% ] 22/30 VUs  3m39.0s/4m00.0s

running (3m40.0s), 22/30 VUs, 2613 complete and 0 interrupted iterations
carga_normal   [  92% ] 22/30 VUs  3m40.0s/4m00.0s

running (3m41.0s), 20/30 VUs, 2622 complete and 0 interrupted iterations
carga_normal   [  92% ] 20/30 VUs  3m41.0s/4m00.0s

running (3m42.0s), 19/30 VUs, 2637 complete and 0 interrupted iterations
carga_normal   [  92% ] 19/30 VUs  3m42.0s/4m00.0s

running (3m43.0s), 18/30 VUs, 2646 complete and 0 interrupted iterations
carga_normal   [  93% ] 18/30 VUs  3m43.0s/4m00.0s

running (3m44.0s), 18/30 VUs, 2655 complete and 0 interrupted iterations
carga_normal   [  93% ] 18/30 VUs  3m44.0s/4m00.0s

running (3m45.0s), 17/30 VUs, 2664 complete and 0 interrupted iterations
carga_normal   [  94% ] 17/30 VUs  3m45.0s/4m00.0s

running (3m46.0s), 16/30 VUs, 2673 complete and 0 interrupted iterations
carga_normal   [  94% ] 16/30 VUs  3m46.0s/4m00.0s

running (3m47.0s), 15/30 VUs, 2681 complete and 0 interrupted iterations
carga_normal   [  95% ] 15/30 VUs  3m47.0s/4m00.0s

running (3m48.0s), 13/30 VUs, 2688 complete and 0 interrupted iterations
carga_normal   [  95% ] 13/30 VUs  3m48.0s/4m00.0s

running (3m49.0s), 13/30 VUs, 2693 complete and 0 interrupted iterations
carga_normal   [  95% ] 13/30 VUs  3m49.0s/4m00.0s

running (3m50.0s), 13/30 VUs, 2699 complete and 0 interrupted iterations
carga_normal   [  96% ] 13/30 VUs  3m50.0s/4m00.0s

running (3m51.0s), 11/30 VUs, 2706 complete and 0 interrupted iterations
carga_normal   [  96% ] 11/30 VUs  3m51.0s/4m00.0s

running (3m52.0s), 10/30 VUs, 2714 complete and 0 interrupted iterations
carga_normal   [  97% ] 10/30 VUs  3m52.0s/4m00.0s

running (3m53.0s), 09/30 VUs, 2718 complete and 0 interrupted iterations
carga_normal   [  97% ] 09/30 VUs  3m53.0s/4m00.0s

running (3m54.0s), 08/30 VUs, 2720 complete and 0 interrupted iterations
carga_normal   [  97% ] 08/30 VUs  3m54.0s/4m00.0s

running (3m55.0s), 06/30 VUs, 2727 complete and 0 interrupted iterations
carga_normal   [  98% ] 06/30 VUs  3m55.0s/4m00.0s

running (3m56.0s), 06/30 VUs, 2728 complete and 0 interrupted iterations
carga_normal   [  98% ] 06/30 VUs  3m56.0s/4m00.0s

running (3m57.0s), 06/30 VUs, 2732 complete and 0 interrupted iterations
carga_normal   [  99% ] 06/30 VUs  3m57.0s/4m00.0s

running (3m58.0s), 04/30 VUs, 2735 complete and 0 interrupted iterations
carga_normal   [  99% ] 04/30 VUs  3m58.0s/4m00.0s

running (3m59.0s), 02/30 VUs, 2738 complete and 0 interrupted iterations
carga_normal   [ 100% ] 02/30 VUs  3m59.0s/4m00.0s

running (4m00.0s), 02/30 VUs, 2739 complete and 0 interrupted iterations
carga_normal   [ 100% ] 02/30 VUs  4m00.0s/4m00.0s

running (4m01.0s), 01/30 VUs, 2740 complete and 0 interrupted iterations
carga_normal ↓ [ 100% ] 02/30 VUs  4m0s

running (4m02.0s), 01/30 VUs, 2740 complete and 0 interrupted iterations
carga_normal ↓ [ 100% ] 02/30 VUs  4m0s


  █ THRESHOLDS 

    http_req_duration
    ✓ 'p(95)<800' p(95)=37.6ms
    ✓ 'p(99)<1500' p(99)=48.65ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    order_creation
    ✓ 'p(95)<1200' p(95)=46.61ms


  █ TOTAL RESULTS 

    checks_total.......: 12378   51.145181/s
    checks_succeeded...: 100.00% 12378 out of 12378
    checks_failed......: 0.00%   0 out of 12378

    ✓ order: status 201
    ✓ order: devuelve id
    ✓ list: status 200
    ✓ help: status 200
    ✓ bill: status 200

    CUSTOM
    order_creation.................: avg=26.41ms min=7.98ms med=23.91ms p(90)=42.1ms  p(95)=46.61ms p(99)=55ms    max=200.15ms
    order_list.....................: avg=6.98ms  min=2.42ms med=6.22ms  p(90)=10.77ms p(95)=12.62ms p(99)=16.86ms max=133.84ms
    orders_created.................: 2741   11.325654/s

    HTTP
    http_req_duration..............: avg=12.45ms min=2.28ms med=7.71ms  p(90)=28.5ms  p(95)=37.6ms  p(99)=48.65ms max=200.15ms
      { expected_response:true }...: avg=12.45ms min=2.28ms med=7.71ms  p(90)=28.5ms  p(95)=37.6ms  p(99)=48.65ms max=200.15ms
    http_req_failed................: 0.00%  0 out of 9637
    http_reqs......................: 9637   39.819528/s

    EXECUTION
    iteration_duration.............: avg=2.05s   min=1.02s  med=2.04s   p(90)=2.85s   p(95)=2.95s   p(99)=3.03s   max=3.11s   
    iterations.....................: 2741   11.325654/s
    vus............................: 1      min=0         max=30
    vus_max........................: 30     min=30        max=30

    NETWORK
    data_received..................: 145 MB 599 kB/s
    data_sent......................: 2.5 MB 10 kB/s



running (4m02.0s), 00/30 VUs, 2741 complete and 0 interrupted iterations
carga_normal ✓ [ 100% ] 00/30 VUs  4m0s